{"pages":[],"posts":[{"title":"ABOUT ME","text":"I am a third-year PhD student in the Computer Science at The University of Hong Kong, supervised by Prof. Taku Komura. I also collaborate closely with Prof. Minchen Li from Carnegie Mellon University on physical simulation and its applications. Before starting my Ph.D journey, I worked with Prof. Hong Qin (Stony Brook University, New York) and Prof. Changbo Wang (ECNU) on Physical Simulation and High-Performance Computing, specifically focusing on real-time fluid simulation. My current research interests include: Physical simulation, High performance computing, Differentiable simulation, Sim2Real(Robotics), Sim4ML, Machine Learning, Geometry processing, Rendering. I hope our research can help advance the development of real-time, physically accurate virtual world, and assist artificial intelligence in gaining a more efficient and comprehensive understanding of the real physical world. We are currently developing the libuipc library. If you are interested in this project and would like to contribute to the development of this important library, please send me an email. We welcome your technical contributions and funding support. We also welcome the cooperations by using our library. NEWS2024 - A preview version of Libuipc is released. Hope it can be helpful for your projects. We will continually strive to develop more comprehensive versions and deliver more valuable application features in the future.2024 - One another interesting and super useful simulation framework will be opensourced soon.2024 - We have opensourced the first fully GPU optimized IPC framework without sacrificing accuracy. Hope it can be helpful for your projects.2024 - We have opensourced a highly optimized GPU MPM framework with clean code design. Hope it can be helpful for high performance simulation learners.2023 - We have opensourced a highly optimized GPU SPH framework. While the code design may not be perfect, the underlying parallel concept is clear and robust. Hope it can be helpful for high performance simulation learners. PROJECTS LIBUIPC (Both C++ and Python API are provided)[source code] [instruction] [python examples]Libuipc is a library that offers a unified GPU incremental potential contact framework for simulating the dynamics of rigid bodies, soft bodies, cloth, and threads. It ensures accurate, penetration-free frictional contact and is naturally differentiable. Libuipc aims to provide robust and efficient forward and backward simulations, making it easy for users to integrate with machine learning frameworks, inverse dynamics, robotics, and more. DiverseShot[Website] [Video]DiverseShot is a free software tool designed to transform videos into immersive 3D experiences. It allows anyone to effortlessly create photorealistic 3D scenes that are accessible via a web browser, all without requiring any coding skills. The software is compatible with Windows, Linux, and macOS. RECENT RESEARCH Stiff-GIPC: Advancing GPU IPC for Stiff Affine-Deformable Simulation.Kemeng Huang, Xinyu Lu*(equal coding contribution), Huancheng Lin, Taku Komura, Minchen Li.[arxiv] [source code coming soon] GIPC: Fast and Stable Gauss-Newton Optimization of IPC Barrier Energy[J].Kemeng Huang, Floyd M. Chitalu, Huancheng Lin, Taku Komura.ACM Transaction on Graphics, 2024. (Siggraph 2024)[paper] [arxiv] [suppDoc] [video] [source code] [i-cable news] A Novel Plastic Phase-Field Method for Ductile Fracture with GPU Optimization[J].Zipeng Zhao*, Kemeng Huang*(equal contributions), Chen Li, Changbo Wang, Hong Qin.Computer Graphics Forum, 2020 (PG 2020).[Paper] [video] [source code] Novel Hierarchical Strategies for SPH-centric Algorithms on GPGPU[J].Kemeng Huang, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin.Graphical Models, 2020.[Paper] [video] [source code] A General Novel Parallel Framework for SPH-centric Algorithms[J].Kemeng Huang, Jiming Ruan, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin.Proceedings of the ACM on Computer Graphics and Interactive Techniques, 2019 (I3D 2019).[Paper] [video] [source code] TEACHING Teaching Assistant, The University of Hong Kong- COMP3329 Computer game design and programming [Section 2A, 2022], Instructor: Dr. T.W. Chim AWARDS Image and Graphics Technology Challenge of China Society of Image and Graphics (CSIG) 2023, Second Place China National Scholarship 2019 China Post-Graduate Mathematical Contest in Modeling 2018, National First Prize International Mathematical Contest in Modeling 2016, Honorable Mention China Undergraduate Mathematical Contest in Modeling 2015, National First Prize EXPERIENCES Visiting PhD Student (Research Assistant) in computer science (computer graphics), Carnegie Mellon University. 2023.11-2024.12 PhD student in computer science (computer graphics and machine learning), Hong Kong University. 2022.9-(2025?) Research Associate (computer graphics), Centre for Transformative Garment Production. 2022.6-2022.9 Research Assistant (computer graphics), Centre for Transformative Garment Production (Hong Kong University Group). 2021.6-2022.6 Research Engineer (computer graphics), Koolab, Kujiale. 2020.8-2021.1 Internship in graphics algorithm (GPU optimization &amp; computer graphics), Intel. 2019.4-2019.8 M.Phi. in Software Engineering (computer graphics), East China Normal University. 2017.9-2020.7 (thesis) Visiting Student in computer science (computer graphics), The College of Computer Science and Technology, Zhejiang University. 2016.11-2017.6 Internship in computer science (computer graphics), State Key Lab of CAD&amp;CG, Zhejiang University. 2015.7-2017.6 B.Eng. in Software Engineering (computer graphics), Jianxing Honors College, Zhejiang University of Technology. 2013.9-2017.7 (thesis) INTERESTS painting, basketball, travel, photography, films, fishing, farming, cooking. CONTACT MEkmhuang@connect.hku.hkKMHuang819@gmail.com unsplash-logoHometown: Taishun County (This place is incredibly beautiful, and I strongly recommend taking the time to visit.), Zhejiang Province, China","link":"/2020/07/10/AboutME/"}],"tags":[{"name":"ME","slug":"ME","link":"/tags/ME/"}],"categories":[{"name":"about me","slug":"about-me","link":"/categories/about-me/"}]}